src/packages/src/xroad/common/addon/wsdlvalidator/usr/share/xroad/wsdl-validator/doc/xroad6.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/"
    xmlns:xrd="http://x-road.eu/xsd/xroad.xsd"
    xmlns:tns="http://v6Example.x-road.eu/producer"
    xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    targetNamespace="http://v6Example.x-road.eu/producer">
    <wsdl:types>
        <schema xmlns="http://www.w3.org/2001/XMLSchema"
            targetNamespace="http://v6Example.x-road.eu/producer"
            elementFormDefault="qualified">
            <import namespace="http://x-road.eu/xsd/xroad.xsd"
                schemaLocation="http://x-road.eu/xsd/xroad.xsd"/>

            <element name="getRandom">
                <complexType> 
                    <sequence>
                        <element name="amount" type="positiveInteger">
                            <annotation>
                                <appinfo>
                                    <xrd:title xml:lang="en">Amount of numbers
                                        to generate</xrd:title>
                                </appinfo>
                            </annotation>
                        </element>
                    </sequence>
                </complexType>
            </element>
            <element name="getRandomResponse">
                <complexType>
                    <sequence>
                        <element name="randomValues" type="tns:randomValues">
                            <annotation>
                                <appinfo>
                                    <xrd:title xml:lang="en">Array
                                        of random values</xrd:title>
                                </appinfo>
                            </annotation>
                        </element>
                    </sequence>
                </complexType>
            </element>
            <complexType name="randomValues">
                <sequence>
                    <element name="randomValue" type="xsd:decimal"
                        minOccurs="1" maxOccurs="1000">
                        <annotation>
                            <appinfo>
                                <xrd:title xml:lang="en">Random
                                    value</xrd:title>
                            </appinfo>
                        </annotation>
                    </element>
                </sequence>
            </complexType>
        </schema>
    </wsdl:types>

    <wsdl:message name="requestHeader">
        <wsdl:part name="client" element="xrd:client"/>
        <wsdl:part name="service" element="xrd:service"/>
        <wsdl:part name="id" element="xrd:id"/>
        <wsdl:part name="userId" element="xrd:userId"/>
        <wsdl:part name="requestHash" element="xrd:requestHash"/>
        <wsdl:part name="issue" element="xrd:issue"/>
        <wsdl:part name="protocolVersion" element="xrd:protocolVersion"/>
    </wsdl:message>

    <wsdl:message name="getRandom">
        <wsdl:part name="body" element="tns:getRandom"/>
    </wsdl:message>
    <wsdl:message name="getRandomResponse">
        <wsdl:part name="body" element="tns:getRandomResponse"/>
    </wsdl:message>

    <wsdl:portType name="v6ExamplePortType">
        <wsdl:operation name="getRandom">
            <wsdl:documentation>
                <xrd:title>Random number generator</xrd:title>
                <xrd:notes>Operation is generating random numbers.</xrd:notes>
                <xrd:techNotes>Operation internally uses /dev/urandom
                    for random number generation. Operation returns
                    only up to 1000 random numbers.</xrd:techNotes>
            </wsdl:documentation>
            <wsdl:input message="tns:getRandom"/>
            <wsdl:output message="tns:getRandomResponse"/>
        </wsdl:operation>
    </wsdl:portType>

    <wsdl:binding name="v6ExampleBinding" type="tns:v6ExamplePortType">
        <soap:binding style="document"
            transport="http://schemas.xmlsoap.org/soap/http"/>
        <wsdl:operation name="getRandom">
            <soap:operation soapAction="" style="document"/>
            <xrd:version>v1</xrd:version>
            <wsdl:input>
                <soap:body use="literal"/>
                <soap:header message="tns:requestHeader"
                    part="client" use="literal"/>
                <soap:header message="tns:requestHeader"
                    part="service" use="literal"/>
                <soap:header message="tns:requestHeader"
                    part="id" use="literal"/>
                <soap:header message="tns:requestHeader"
                    part="userId" use="literal"/>
                <soap:header message="tns:requestHeader"
                    part="issue" use="literal"/>
                <soap:header message="tns:requestHeader"
                    part="protocolVersion" use="literal"/>
            </wsdl:input>
            <wsdl:output>
                <soap:body use="literal"/>
                <soap:header message="tns:requestHeader"
                    part="client" use="literal"/>
                <soap:header message="tns:requestHeader"
                    part="service" use="literal"/>
                <soap:header message="tns:requestHeader"
                    part="id" use="literal"/>
                <soap:header message="tns:requestHeader"
                    part="userId" use="literal"/>
                <soap:header message="tns:requestHeader"
                    part="requestHash" use="literal"/>
                <soap:header message="tns:requestHeader"
                    part="issue" use="literal"/>
                <soap:header message="tns:requestHeader"
                    part="protocolVersion" use="literal"/>
            </wsdl:output>
        </wsdl:operation>
    </wsdl:binding>

    <wsdl:service name="v6ExampleService">
        <wsdl:port binding="tns:v6ExampleBinding" name="v6ExampleServicePort">
            <soap:address location="http://localhost:8080"/>
        </wsdl:port>
    </wsdl:service>
</wsdl:definitions>
